#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westus"
      + max_bid_price                   = -1
      + name                            = "jump-box"
      + network_interface_ids           = (known after apply)
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "aks"
      + size                            = "Standard_B1LS"
      + tags                            = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "thevitch"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.vm will be created
  + resource "azurerm_network_interface" "vm" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus"
      + mac_address                   = (known after apply)
      + name                          = "example-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "aks"
      + tags                          = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "internal"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_security_group.aks_nsg will be created
  + resource "azurerm_network_security_group" "aks_nsg" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "paks_nsg"
      + resource_group_name = "aks"
      + security_rule       = (known after apply)
    }

  # azurerm_public_ip.vm will be created
  + resource "azurerm_public_ip" "vm" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus"
      + name                    = "jump-box-pip"
      + resource_group_name     = "aks"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.aks will be created
  + resource "azurerm_resource_group" "aks" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "aks"
      + tags     = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
    }

  # azurerm_subnet.akscontrolsub will be created
  + resource "azurerm_subnet" "akscontrolsub" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "172.16.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "akscontrolsub"
      + resource_group_name                            = "aks"
      + virtual_network_name                           = "aksnet"
    }

  # azurerm_subnet.aksnodesub will be created
  + resource "azurerm_subnet" "aksnodesub" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "172.16.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "aksnodesub"
      + resource_group_name                            = "aks"
      + virtual_network_name                           = "aksnet"
    }

  # azurerm_virtual_network.aksvnet will be created
  + resource "azurerm_virtual_network" "aksvnet" {
      + address_space         = [
          + "172.16.0.0/23",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westus"
      + name                  = "aksnet"
      + resource_group_name   = "aks"
      + subnet                = (known after apply)
      + tags                  = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + vm_protection_enabled = false
    }

  # null_resource.cluster will be created
  + resource "null_resource" "cluster" {
      + id = (known after apply)
    }

  # tls_private_key.paks will be created
  + resource "tls_private_key" "paks" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 4096
    }

  # module.paks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = [
          + "172.16.0.0/23",
        ]
      + dns_prefix                          = "k8sa"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.21.1"
      + location                            = "westus"
      + name                                = "private-aks-westus-dev"
      + node_resource_group                 = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + resource_group_name                 = "aks"
      + sku_tier                            = "Free"
      + tags                                = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }

      + addon_profile {

          + http_application_routing {
              + enabled                            = false
              + http_application_routing_zone_name = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "nodes"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "AvailabilitySet"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS3_v2"
          + vnet_subnet_id       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + linux_profile {
          + admin_username = "myk8sboss"

          + ssh_key {
              + key_data = (known after apply)
            }
        }

      + network_profile {
          + dns_service_ip     = "63.96.91.126"
          + docker_bridge_cidr = "192.168.0.1/16"
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = "63.96.91.0/25"

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true

          + azure_active_directory {
              + managed   = true
              + tenant_id = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.paks.azurerm_network_security_rule.aks["deny_tcp_10250_inbound"] will be created
  + resource "azurerm_network_security_rule" "aks" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "10250"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "deny_tcp_10250_inbound"
      + network_security_group_name = "paks_nsg"
      + priority                    = 500
      + protocol                    = "Tcp"
      + resource_group_name         = "aks"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.paks.azurerm_network_security_rule.aks["deny_tcp_10255_inbound"] will be created
  + resource "azurerm_network_security_rule" "aks" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "10255"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "deny_tcp_10255_inbound"
      + network_security_group_name = "paks_nsg"
      + priority                    = 510
      + protocol                    = "Tcp"
      + resource_group_name         = "aks"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kube_config = (sensitive value)
  + ssh_key     = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*